routes/web.php

select * from "employers"
select * from "tags"
select * from "employers" where "employers"."id" in (1, 2, 3, 4, 5)
---

//Show Create Form
Route::get('/jobs/create', function(){
    return view('jobs.create',[
        'employers' => Employer::all(),
        'tags' => Tag::all()
    ]);
})->name('jobs.create');


Route::get('/jobs', function () {
return view('jobs.index', [
    'jobs' => Job::with('employer', 'tags')->paginate(5)
]);
})->name('jobs.index');

select * from "employers"
select * from "tags"
---
})->name('jobs.store');

// Show Edit Form
Route::get('/jobs/{job}/edit', function (\App\Models\Job $job) {
    return view('jobs.edit', [
        'job' => $job,
        'employers' => Employer::all(),
        'tags' => Tag::all()
    ]);
})->name('jobs.edit');

insert into "job_tag" ("job_listing_id", "tag_id") values (1, 1)
---

    // ✅ Sync tags (pivot table)
    if (isset($validated['tags'])) {
        $job->tags()->sync($validated['tags']);