app/Http/Controllers/JobController.php

public function index() {
    return view('jobs.index', [
    'jobs' => Job::with('employer', 'tags')->paginate(5)
    ]);
---
select * from "employers" where "employers"."id" in (4, 6, 7, 8, 9)

public function create() {
    return view('jobs.create',[
        'employers' => Employer::all(),
        'tags' => Tag::all()
    ]);
---
select * from "employers"
select * from "tags"

public function store() {
    request()->validate([
        'title' => ['required', 'min:3'],
        'salary' => ['required'],
        'employer_id' => ['required'],
        'tags' => ['required']
    ]);

    $job = Job::create([
    'title' => request('title'),
    'salary' => request('salary'),
    'employer_id' => request('employer_id'),
    ]);

// Attach tags (if provided)
if (request('tags')) {
    $job->tags()->sync(request('tags'));
---
insert into "job_tag" ("job_listing_id", "tag_id") values (23, 1)

public function edit(Job $job) {
    return view('jobs.edit', [
        'job' => $job,
        'employers' => Employer::all(),
        'tags' => Tag::all()
---
select * from "employers"
select * from "tags"